\chapter{Массивы}

\section{Лабораторная работа 1. Одномерные массивы}
\begin{enumerate}[leftmargin=*]
    \item Дан массив вещественных чисел. Найдите сумму отрицательных элементов массива.
    \begin{lstlisting}
        #include <iostream>

        using namespace std;

        int main(')
        {
            int n=10;
            double x[n];
            double sum=0.0;
            for (int i=0; i<n; i++')
            {
                cout << "Please, input x[" << i << "]="; cin >> x[i];
                if (x[i]<0') sum+=x[i];
            }
            cout << "Summa = " << sum;
            return 0;
        }
    \end{lstlisting}
    \item Найдите произведение элементов массива с нечетными номерами.
    \begin{lstlisting}
        #include <iostream>
        #include <ctime>
        #include <cstdlib>

        using namespace std;

        int main(')
        {
            double x[10];
            srand(time(0')');
            for (int i=0; i<n; i++')
            {
                x[i]=1.0+rand(')%100;
                cout << x[i] << "\n";
            }
            cout << endl;
            for (int i=0; i<n; i++')
            {
                if (i%2!=0') cout << i << "\n";
            }
            return 0;
        }
    \end{lstlisting}
    \item Дан массив целых чисел. Количество запросить с клавиатуры. Найти максимальный (минимальный) элемент массива и его номер, при условии, что все элементы различные.
    \item Найдите наименьший четный элемент массива. Если такого нет, то выведите первый элемент.
    \item Преобразовать массив так, чтобы сначала шли нулевые элементы, а затем все остальные.
    \item Ввести массив, в котором только два одинаковых элемента. Определить их местоположение.
    \item Ввести два массива действительных чисел. Определить максимальные элементы в каждом массиве и поменять их местами.
    \item Задан целочисленный массив. Определить процентное содержание элементов, превышающих среднеарифметическое всех элементов массива.
    \item Выполнить сортировку массива по возрастанию (убыванию).
    \item Дан массив из 10 элементов. Первые 4 упорядочить по возрастанию, последние 4 по убыванию.
\end{enumerate}
\section{Лабораторная работа 2. Сортировка и упорядочение массивов}
\begin{enumerate}[leftmargin=*]
    \item Создайте матрицу случайных чисел размерности $n \times m$ в диапазоне $[1;10]$.
    \begin{lstlisting}
        #include <iostream>
        #include <cstdlib>
        #include <ctime>
        using namespace std;

        int main(')
        {
            srand(time(0')');
            const int n=5, m=6;
            int x[n][m];
            for (int i=0; i<n; i++')
            {
                for (int j=0; j<m; j++')
                {
                    x[i][j]=1+rand(')%10;
                    cout << x[i][j]<<"\t";
                }
                cout <<"\n";
            }
            return 0;
        }
    \end{lstlisting}
    \item Дана квадратная матрица. Вывести на экран элементы, стоящие на диагонали.
    \item Дана матрица. Вывести на экран все нечетные столбцы, у которых первый элемент меньше последнего.
    \item Дана матрица $N\times M$ случайных чисел. Отсортировать элементы главной диагонали матрицы по убыванию.
    \item Дана матрица $N\times M$ случайных чисел. Упорядочить первый столбец матрицы по возрастанию, а последний столбец --- по убыванию.
    \item Дан массив из 10 элементов. Отсортируйте отдельно элементы от 0-го по 2-й, с 3-го по 5-й и с 6-го по 9.
    \item Дан трехмерный массив $N\times M\times K$ случайных чисел $(N, M, K>5)$. Отсортируйте матрицу $N\times M$ при $K=2$ и выведите её на экран монитора.
    \item Дан массив 20 целых чисел на отрезке $[-2;5]$. Упорядочить массив, удалив нули со сдвигом влево, ненулевыми элементами.
    \item Дан массив 20 целых чисел на отрезке $[-5;5]$. Упорядочить массив, удалив повторяющиеся элементы.
    \item Дан массив. Найдите два соседних элемента, сумма которых минимальна.
    \item В данном массиве найдите количество чисел, соседи у которых отличаются более чем в 2 раза.
\end{enumerate}
\section{Самостоятельная работа 1}
\begin{enumerate}[leftmargin=*]
    \item Дана матрица. Вывести на экран все четные строки.
    \item Найдите сумму номеров минимального и максимального элементов массива.
    \item Введите одномерный целочисленный массив. Найдите наибольший нечетный элемент. Далее осуществите циклический сдвиг влево элементов, стоящих справа от найденного максимума.
    \item Дан массив размером nxn, элементы которого целые числа. Для каждого столбца подсчитать сумму отрицательных элементов и записать данные в текстовый файл.
    \item В двумерном массиве, элементы которого целые числа, удалить все столбцы, в которых первый элемент больше последнего. Результат записать в файл.
\end{enumerate}